app/Http/Controllers/Api/BannerController.php

    public function index(Request $request)
    {
        return BannerResource::collection(Banner::latest()->with('listing')->get());
---
select * from `banners` order by `created_at` desc