app/Http/Controllers/Api/CategoryController.php

select * from `categories` where `categories`.`main_category_id` in (3)
---
    public function mainCategories()
    {
        $categories = MainCategory::active()->paginate(10);