app/Http/Controllers/Api/CityController.php

select * from `cities` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `cities`
---
    public function index(Request $request)
    {
        $request->validate([
            'search'                 =>'nullable|string',
        ]);

        $cities = City::when($request->filled('search'), function ($query) use ($request) {
            $locale = app()->getLocale();
            $query->where("name->{$locale}", 'like', '%' . $request->search . '%')
            ->orWhere("description->{$locale}", 'like', '%' . $request->search . '%');
        })->latest()->paginate(10);