app/Http/Controllers/Api/GeneralController.php

select * from `offers` where `content` like '%Ali%' limit 10 offset 0
select count(*) as aggregate from `offers` where `content` like '%Ali%'
---
    public function offers(Request $request)
    {
        $request->validate([
            'listing_id'                => 'nullable|exists:listings,id',
            'category_id'               => 'nullable|exists:categories,id',
            'search'                    => 'nullable|string',
            'is_active'                 => 'nullable|boolean',
        ]);

        $offers = Offer::with(['listing' => function ($query) {
            $query->withIsLiked();
        }])->when($request->filled('listing_id'), function ($query) use ($request) {
            $query->where('listing_id', $request->listing_id);
        })->when($request->filled('category_id'), function ($query) use ($request) {
            $query->whereHas('listing.category', function ($query) use ($request) {
                $query->where('id', $request->category_id);
            });
        })->when($request->filled('search'), function ($query) use ($request) {
            $query->where('content', 'like', '%' . $request->search . '%');
        })->when($request->boolean('is_active'), function ($query) {
            $query->whereBetween('start_date', [now(), 'end_date']);
        })->paginate(10);

select * from `areas` where `city_id` = '1' and json_unquote(json_extract(`name`, '$."ar"')) like '%ses%' limit 10 offset 0
select * from `cities` where `cities`.`id` in (1)
select count(*) as aggregate from `areas` where `city_id` = '1' and json_unquote(json_extract(`name`, '$."ar"')) like '%ses%'
---
    public function areas(Request $request)
    {
        $request->validate([
            'city_id'               => 'nullable|exists:cities,id',
            'search'                => 'nullable|string',
        ]);
        $locale = app()->getLocale();
        $areas = Area::with('city')->when($request->filled('city_id'), function ($query) use ($request) {
            $query->where('city_id', $request->city_id);
        })->when($request->filled('search'), function ($query) use ($request , $locale) {
            $query->where("name->{$locale}", 'like', '%' . $request->search . '%');
        })->paginate(10);

select * from `comments` where `listing_id` = 1 order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (5)
select count(*) as aggregate from `comments` where `listing_id` = 1
---
    public function commentsIndex(Request $request , Listing $listing)
    {
        $request->validate([
            'search'                =>'nullable|string',
        ]);

        $user = Auth::guard('sanctum')->user();

        $comments = Comment::with(['user','parent.user','replies.user'])
            ->where('listing_id',$listing->id)
            ->when($request->filled('search'), function ($q) use ($request) {
                $q->where('comment','like',"%{$request->search}%");
            })
            ->latest()
            ->paginate(10);

select * from `ratings` where `user_id` = 5 and `listing_id` = 1 limit 1
insert into `ratings` (`rating`, `comment`, `user_id`, `listing_id`, `updated_at`, `created_at`) values ('3', 'very bad service', 5, 1, '2026-01-03 16:32:06', '2026-01-03 16:32:06')
select * from `listings` where `listings`.`id` in (1)
select * from `users` where `users`.`id` in (5)
---
    public function rate(Request $request , Listing $listing)
    {
        $request->validate([
            'rating'            =>'required|integer|min:0|max:5',
            'comment'           =>'nullable|string',
        ]);

        $user = Auth::guard('sanctum')->user();

        $rating = Rating::where('user_id',$user->id)->where('listing_id',$listing->id)->first();
        if($rating){
            return response()->json(['message' => __('You have already rated this listing')], 40);
        }

        $rating = Rating::create([
            'rating'                =>$request->rating,
            'comment'               =>$request->comment,
            'user_id'               =>$user->id,
            'listing_id'            =>$listing->id,
        ]);

        $rating->load(['user','listing']);