app/Http/Controllers/Api/ListingController.php

select * from `categories` where `categories`.`id` in (2)
---
            });
        });

        $listings->when($request->filled('category_id'), function ($listings) use ($request) {
            $listings->whereHas('category', function ($query) use ($request) {
                $query->where('id', $request->category_id);
            });
        });

select * from `options` where `options`.`id` in (1, 2, 3)
select `option_values`.*, `listing_option_value`.`listing_id` as `pivot_listing_id`, `listing_option_value`.`option_value_id` as `pivot_option_value_id` from `option_values` inner join `listing_option_value` on `option_values`.`id` = `listing_option_value`.`option_value_id` where `listing_option_value`.`listing_id` in (1)
select `amenities`.*, `amenity_listings`.`listing_id` as `pivot_listing_id`, `amenity_listings`.`amenity_id` as `pivot_amenity_id` from `amenities` inner join `amenity_listings` on `amenities`.`id` = `amenity_listings`.`amenity_id` where `amenity_listings`.`listing_id` in (1)
---
            });
        });

        $listings->when($request->filled('option_value_id'), function ($listings) use ($request) {
            $listings->whereHas('optionValues', function ($query) use ($request) {
                $query->where('id', $request->option_value_id);
            });
        });

        $listings->when($request->filled('amenity_id'), function ($listings) use ($request) {
            $listings->whereHas('amenities', function ($query) use ($request) {
                $query->where('id', $request->amenity_id);
            });
        });

select * from `categories` where `categories`.`id` in (2)
select `amenities`.*, `amenity_listings`.`listing_id` as `pivot_listing_id`, `amenity_listings`.`amenity_id` as `pivot_amenity_id` from `amenities` inner join `amenity_listings` on `amenities`.`id` = `amenity_listings`.`amenity_id` where `amenity_listings`.`listing_id` in (1)
select `option_values`.*, `listing_option_value`.`listing_id` as `pivot_listing_id`, `listing_option_value`.`option_value_id` as `pivot_option_value_id` from `option_values` inner join `listing_option_value` on `option_values`.`id` = `listing_option_value`.`option_value_id` where `listing_option_value`.`listing_id` in (1)
---
    public function myListings(Request $request)
    {
        $user = Auth::guard('sanctum')->user();

        $listings = $user->listings()
            ->withIsLiked()
            ->with(['category', 'nearestListingBranch','amenities','optionValues'])
            ->active()
            ->latest()
            ->paginate(10);

select exists(select * from `listing_users` where `user_id` = 5 and `listing_id` = '1') as `exists`
---
    public function likeToggle(Request $request)
    {
        $request->validate([
            'listing_id' => 'required|exists:listings,id',
        ]);

        $user = Auth::guard('sanctum')->user();
        if (!$user) {
            return response()->json([
                'message' => __('unauthenticated'),
            ], 401);
        }

        $liked = DB::table('listing_users')
            ->where('user_id', $user->id)
            ->where('listing_id', $request->listing_id)
            ->exists();