app/Http/Controllers/Api/ListingController.php

    public function myListings(Request $request)
    {
        $user = Auth::guard('sanctum')->user();

        $listings = $user->listings()
            ->withIsLiked()
            ->with(['category', 'nearestListingBranch'])
            ->active()
            ->paginate(10);
---
select * from `categories` where `categories`.`id` in (2)