app/Http/Controllers/Api/OtpController.php

    public function send(Request $request)
    {
        $user = Auth::guard('sanctum')->user();
        if ($user->phone_verified_at) {
            return response()->json([
                'message'                   => __('Your Phone Is Verified')
            ], 401);
        }
        $otp = random_int(10000, 99999);

        $user->otp_code = $otp;
        $user->otp_expires_at = now()->addMinutes(5);
        $user->save();
---
update `users` set `otp_code` = 21345, `otp_expires_at` = '2026-01-03 12:42:41', `users`.`updated_at` = '2026-01-03 12:37:41' where `id` = 5