app/Livewire/AreasIndex.php

    public function render()
    {
        $query = Area::query()->with('city');

        // Apply search filter
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm) {
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.ar')) LIKE ?", [$searchTerm]);
            });
        }

        // Apply city filter
        if ($this->cityFilter != 'all') {
            $query->where('city_id', $this->cityFilter);
        }

        $areas = $query->latest('updated_at')->paginate(10);
---
select * from `areas` order by `updated_at` desc limit 10 offset 0
select * from `cities` where `cities`.`id` in (1)
select count(*) as aggregate from `areas`