app/Livewire/BranchesIndex.php

    public function render()
    {
        $locale = app()->getLocale();
        $query = ListingBranch::query()
            ->with(['listing', 'area.city'])
            ->withoutGlobalScopes(); // Remove global scopes for admin view

        // Apply search filter (search by address and listing name)
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm, $locale) {
                // Search in address (translatable)
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(address, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(address, '$.ar')) LIKE ?", [$searchTerm])
                  // Search in listing name (through relationship)
                  ->orWhereHas('listing', function ($listingQuery) use ($searchTerm, $locale) {
                      $listingQuery->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                                    ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm]);
                  });
            });
        }

        // Apply city filter (through area relationship)
        if ($this->cityFilter != 'all') {
            $query->whereHas('area', function ($areaQuery) {
                $areaQuery->where('city_id', $this->cityFilter);
            });
---
select * from `areas` where `areas`.`id` in (2, 3)
select * from `cities` where `cities`.`id` in (1)
select * from `listings` where `listings`.`id` in (1)