app/Livewire/CategoriesIndex.php

    public function render()
    {
        $query = Category::query()->with(['mainCategory', 'options']);

        // Apply search filter
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm) {
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.ar')) LIKE ?", [$searchTerm]);
            });
        }

        // Apply status filter
        if ($this->statusFilter != 'all') {
            $query->where('status', $this->statusFilter);
        }

        // Apply main category filter
        if ($this->mainCategoryFilter != 'all') {
            $query->where('main_category_id', $this->mainCategoryFilter);
        }

        $categories = $query->latest('updated_at')->paginate(10);
---
select * from `categories` order by `updated_at` desc limit 10 offset 0
select `options`.*, `category_option`.`category_id` as `pivot_category_id`, `category_option`.`option_id` as `pivot_option_id` from `options` inner join `category_option` on `options`.`id` = `category_option`.`option_id` where `category_option`.`category_id` in (2, 3)
select count(*) as aggregate from `categories`