app/Livewire/ListingsIndex.php

select * from `categories` where `categories`.`id` in (2)
select `option_values`.*, `listing_option_value`.`listing_id` as `pivot_listing_id`, `listing_option_value`.`option_value_id` as `pivot_option_value_id` from `option_values` inner join `listing_option_value` on `option_values`.`id` = `listing_option_value`.`option_value_id` where `listing_option_value`.`listing_id` in (1)
---
    public function render()
    {
        $locale = app()->getLocale();
        $query = Listing::query()
            ->with(['category', 'amenities', 'optionValues'])
            ->withCount([
                'users',
                'branches',
                'amenities',
                'optionValues'
            ])
            ->withAvg('ratings', 'rating');

        // Apply search filter
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm, $locale) {
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.ar')) LIKE ?", [$searchTerm])
                  ->orWhereHas('category', function ($categoryQuery) use ($searchTerm, $locale) {
                      $categoryQuery->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                                    ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm]);
                  });
            });
        }

        // Apply category filter
        if ($this->categoryFilter != 'all') {
            $query->where('category_id', $this->categoryFilter);

select `amenities`.*, `amenity_listings`.`listing_id` as `pivot_listing_id`, `amenity_listings`.`amenity_id` as `pivot_amenity_id` from `amenities` inner join `amenity_listings` on `amenities`.`id` = `amenity_listings`.`amenity_id` where `amenity_listings`.`listing_id` in (1)
---

        // Apply amenity filter
        if ($this->amenityFilter != 'all') {
            $query->whereHas('amenities', function ($q) {
                $q->where('amenities.id', $this->amenityFilter);
            });