app/Livewire/MainCategoriesIndex.php

    public function render()
    {
        $query = MainCategory::query();

        // Apply search filter
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm) {
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(description, '$.ar')) LIKE ?", [$searchTerm]);
            });
        }

        // Apply status filter
        if ($this->statusFilter != 'all') {
            $query->where('status', $this->statusFilter);
        }

        $categories = $query->latest('updated_at')->paginate(10);
---
select * from `main_categories` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `main_categories`