app/Livewire/OptionValuesIndex.php

    public function render()
    {
        $query = OptionValue::query()->with('option');

        // Apply search filter
        if ($this->search) {
            $searchTerm = '%' . $this->search . '%';
            $query->where(function ($q) use ($searchTerm) {
                $q->whereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.en')) LIKE ?", [$searchTerm])
                  ->orWhereRaw("JSON_UNQUOTE(JSON_EXTRACT(name, '$.ar')) LIKE ?", [$searchTerm]);
            });
        }

        // Apply option filter
        if ($this->optionFilter != 'all') {
            $query->where('option_id', $this->optionFilter);
        }

        $optionValues = $query->latest('updated_at')->paginate(10);
---
select * from `option_values` where `option_id` = '2' order by `updated_at` desc limit 10 offset 0
select * from `options` where `options`.`id` in (1)
select count(*) as aggregate from `option_values` where `option_id` = '2'