app/Http/Controllers/AdminController.php

select * from `permissions` where `id` in ('2', '4', '9', '10', '11', '12')
---
        $admin->update($updateData);

        // Sync multiple permissions (convert IDs to Permission models)
        $permissions = Permission::whereIn('id', $request->permissions)->get();

update `users` set `status` = 'active', `users`.`updated_at` = '2025-12-31 18:31:51' where `id` = 4
---
    public function toggleStatus($id)
    {
        $admin = User::role('admin')->findOrFail($id);

        $admin->status = $admin->status == 'active' ? 'inactive' : 'active';
        $admin->save();