app/Http/Controllers/AreaController.php

    public function index()
    {
        $cities = City::select('id', 'name')->get();
---
select `id`, `name` from `cities`

    public function search(Request $request)
    {
        $locale = app()->getLocale();

        $search = "%{$request->query('q')}%";
        $cityId = $request->query('city_id');

        $query = Area::where(function ($query) use ($search, $locale) {
            $query->where("name->{$locale}", 'LIKE', $search);
        });

        // Filter by city if provided
        if ($cityId) {
            $query->where('city_id', $cityId);
        }

        $areas = $query->limit(10)->get();
---
select * from `areas` where (json_unquote(json_extract(`name`, '$."en"')) LIKE '%%') and `city_id` = '1' limit 10