app/Http/Controllers/BannerController.php

select count(*) as aggregate from `banners`
---
    public function index()
    {
        $banners = Banner::paginate(10);