app/Http/Controllers/ListingBranchController.php

    public function index()
    {
        $cities = \App\Models\City::all();
        $areas = \App\Models\Area::all();
---
select * from `cities`
select * from `areas`

    public function store(Request $request)
    {
        $request->validate([
            'address_ar'                => 'required|string',
            'address_en'                => 'required|string',
            'listing_id'                => 'required|exists:listings,id',
            'area_id'                   => 'required|exists:areas,id',
            'latitude'                  => 'required|numeric|between:-90,90',
            'longitude'                 => 'required|numeric|between:-180,180',
            'phone'                     => 'nullable|string|max:15',
            'phone_alt'                 => 'nullable|string|max:15',
        ]);

        ListingBranch::withoutGlobalScopes()->create([
            'listing_id'                        => $request->listing_id,
            'area_id'                           => $request->area_id,
            'address'                           => [
                'en'                                => $request->address_en,
                'ar'                                => $request->address_ar,
            ],
            'latitude'                          => $request->latitude,
            'longitude'                         => $request->longitude,
            'phone'                             => $request->phone,
            'phone_alt'                         => $request->phone_alt,
        ]);
---
insert into `listing_branches` (`listing_id`, `area_id`, `address`, `latitude`, `longitude`, `phone`, `phone_alt`, `updated_at`, `created_at`) values ('1', '2', '{\"en\":\"85028 Adah Curve\",\"ar\":\"815 Schaefer Lock\"}', '30.1234', '30.1234', '885-232-5146', '504-428-0534', '2025-12-31 16:06:35', '2025-12-31 16:06:35')

    public function destroy($id)
    {
        $serviceProviderBranch = ListingBranch::findOrFail($id);
---
select * from `listing_branches` where `id` = '1' limit 1