app/Http/Controllers/OfferController.php

select * from `listings`
---
    public function index()
    {
        $listings = Listing::all();

insert into `offers` (`content`, `listing_id`, `image`, `start_date`, `end_date`, `updated_at`, `created_at`) values ('{\"ar\":\"Aliquam maxime quidem aperiam sint sit magni.\",\"en\":\"Doloribus dolor illum incidunt quisquam autem.\"}', '1', 'offers/0EAq01AYkAJ1g0cFdOcYxAZdtME2c9w7ZCSGBaOf.png', '2026-01-18 06:48:00', '2026-03-30 15:56:00', '2025-12-31 16:29:13', '2025-12-31 16:29:13')
---
    public function store(Request $request)
    {
        $request->validate([
            'content_ar'                => 'required|string|max:150',
            'content_en'                => 'required|string|max:150',
            'image'                     => 'required|image|max:5120',
            'listing_id'                => 'required|exists:listings,id',
            'start_date'                => 'required|date',
            'end_date'                  => 'required|date|after:start_date',
        ]);

        $image  = $request->file('image');
        $image_path = $image->store('offers', 'public');

        Offer::create([
            'content' => [
                'ar' => $request->content_ar,
                'en' => $request->content_en,
            ],
            'listing_id' => $request->listing_id,
            'image' => $image_path,
            'start_date' => $request->start_date,
            'end_date' => $request->end_date,
        ]);

select * from `listings` where `listings`.`id` in (1)
---
    public function edit(Offer $offer)
    {
        $offer->load('listing');