app/Http/Controllers/OptionController.php

insert into `options` (`name`, `description`, `updated_at`, `created_at`) values ('{\"en\":\"Johnathon Graham\",\"ar\":\"Kailyn Bergstrom\"}', '{\"en\":\"Occaecati ipsa ducimus neque aperiam aliquid.\",\"ar\":\"Esse aut sunt.\"}', '2025-12-31 11:34:59', '2025-12-31 11:34:59')
---
    public function store(Request $request)
    {
        $request->validate([
            'name_ar'                   => 'required|string|max:255',
            'name_en'                   => 'required|string|max:255',
            'description_ar'            => 'nullable|string',
            'description_en'            => 'nullable|string',
        ]);

        Option::create([
            'name'                      => [
                'en'                        => $request->name_en,
                'ar'                        => $request->name_ar,
            ],
            'description'               => [
                'en'                        => $request->description_en,
                'ar'                        => $request->description_ar,
            ],
        ]);