app/Http/Controllers/OptionValueController.php

select `id`, `name` from `options`
---
    public function index()
    {
        $options = Option::select('id', 'name')->get();

select `id`, `name` from `options` order by `updated_at` desc
---
    public function create()
    {
        $options = Option::latest('updated_at')->select('id', 'name')->get();

select `id` from `options`
insert into `option_values` (`name`, `option_id`, `updated_at`, `created_at`) values ('{\"en\":\"Harrison Oberbrunner\",\"ar\":\"Akeem Dickinson\"}', '3', '2025-12-31 11:39:05', '2025-12-31 11:39:05')
---
    public function store(Request $request)
    {
        $options = Option::pluck('id')->toArray();
        $request->validate([
            'name_ar'                   => 'required|string|max:255',
            'name_en'                   => 'required|string|max:255',
            'option_id'                 => ['required', 'exists:options,id'],
        ]);

        OptionValue::create([
            'name'                      => [
                'en'                        => $request->name_en,
                'ar'                        => $request->name_ar,
            ],
            'option_id'                 => $request->option_id,
        ]);