app/Http/Controllers/Dashboard/AmenityController.php

    public function index()
    {
        $categories = Category::all();
---
select * from `categories`