app/Http/Controllers/Dashboard/BannerController.php

select * from `banners` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `banners`
---
    public function index()
    {
        $banners = Banner::latest('updated_at')->paginate(10);

delete from `banners` where `id` = 1
---
    public function destroy(Banner $banner)
    {
        if ($banner->image) {
            Controller::deleteFile($banner->image);
        }
        $banner->delete();