app/Http/Controllers/Dashboard/CategoryController.php

select `id`, `name` from `main_categories`
---
    public function index()
    {
        $main_categories = MainCategory::select('id', 'name')->get();

select `id`, `name` from `main_categories` order by `updated_at` desc
select * from `options` order by `updated_at` desc
---
    public function edit(Category $category)
    {
        $categories = MainCategory::latest('updated_at')
            ->select('id', 'name')->get();
        $category->load('options');

select `id` from `main_categories`
---
    public function update(Request $request, Category $category)
    {
        $categories = MainCategory::pluck('id')->toArray();

insert into `category_option` (`category_id`, `option_id`) values (3, 1)
---
            'status'            => $request->status,
        ]);

        $category->options()->sync($request->option_ids ?? []);