app/Http/Controllers/Dashboard/CommenterController.php

select * from `listings` where `listings`.`id` in (1)
---
    public function index()
    {
        $users = User::withCount(['listings'])
            ->with('commenterListing')
            ->commenters()
            ->latest()
            ->whereDoesntHave('roles')
            ->get();

select * from `listings`
---
    public function create()
    {
        $listings = Listing::all();

select exists(select * from `users` where `country_code` = '+20' and `phone_number` = '1159175049') as `exists`
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'nullable|email|max:255|unique:users,email',
            'phone_number' => 'required|string|max:15',
            'country_code' => 'required|string|max:5',
            'password' => 'required|string|min:8',
            'commenter_id' => 'required|exists:listings,id',
            'status' => 'required|in:active,inactive',
            'image' => 'nullable|image|max:2048',
            'email_verified' => 'nullable|boolean',
            'phone_verified' => 'nullable|boolean',
        ]);

        // Validate Egyptian phone number
        $fullPhone = $request->country_code . $request->phone_number;
        if (!preg_match('/^\+201[0-9]{9}$/', $fullPhone)) {
            return redirect()->back()
                ->withInput()
                ->withErrors(['phone_number' => __('Invalid Egyptian phone number. Format: +20XXXXXXXXXX')]);
        }

        // Check if phone number already exists
        if (User::where('country_code', $request->country_code)
            ->where('phone_number', $request->phone_number)->exists()) {

insert into `users` (`name`, `phone_number`, `country_code`, `password`, `status`, `commenter_id`, `email`, `email_verified_at`, `phone_verified_at`, `updated_at`, `created_at`) values ('Brisa Nitzsche', '1159175049', '+20', '$2y$12$27KP.Cz80pbVnlnKob8zg.qImJEFYfOvlOR4uSw5m56DOuh1Zeu.e', 'active', '1', 'your.email+fakedata76586@gmail.com', '2025-12-31 18:05:40', '2025-12-31 18:05:40', '2025-12-31 18:05:40', '2025-12-31 18:05:40')
---
            $userData['image'] = $request->file('image')->store('users', 'public');
        }

        User::create($userData);

select * from `users` where `commenter_id` is not null and `users`.`id` = '2' limit 1
select * from `listings`
---
    public function edit(string $id)
    {
        $user = User::commenters()->findOrFail($id);
        $listings = Listing::all();

select * from `users` where `commenter_id` is not null and `users`.`id` = '2' limit 1
select exists(select * from `users` where `country_code` = '+20' and `phone_number` = '1159175049' and `id` != '2') as `exists`
---
    public function update(Request $request, string $id)
    {
        $user = User::commenters()->findOrFail($id);

        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'nullable|email|max:255|unique:users,email,' . $id,
            'phone_number' => 'required|string|max:15',
            'country_code' => 'required|string|max:5',
            'password' => 'nullable|string|min:8',
            'commenter_id' => 'required|exists:listings,id',
            'status' => 'required|in:active,inactive',
            'image' => 'nullable|image|max:2048',
            'email_verified' => 'nullable|boolean',
            'phone_verified' => 'nullable|boolean',
        ]);

        // Validate Egyptian phone number
        $fullPhone = $request->country_code . $request->phone_number;
        if (!preg_match('/^\+201[0-9]{9}$/', $fullPhone)) {
            return redirect()->back()
                ->withInput()
                ->withErrors(['phone_number' => __('Invalid Egyptian phone number. Format: +20XXXXXXXXXX')]);
        }

        // Check if phone number already exists (excluding current user)
        if (User::where('country_code', $request->country_code)
            ->where('phone_number', $request->phone_number)
            ->where('id', '!=', $id)->exists()) {

update `users` set `email_verified_at` = '2025-12-31 18:13:09', `phone_verified_at` = '2025-12-31 18:13:09', `image` = 'users/US7wjIlJPxHw5QKM95B88CR8DdWPneqJoc9z9WyD.png', `users`.`updated_at` = '2025-12-31 18:13:09' where `id` = 2
---
            $userData['image'] = $request->file('image')->store('users', 'public');
        }

        $user->update($userData);

select * from `users` where `commenter_id` is not null and `users`.`id` = '2' limit 1
delete from `users` where `id` = 2
---
    public function destroy(string $id)
    {
        $user = User::commenters()->findOrFail($id);
        if ($user->image) {
            Controller::deleteFile($user->image);
        }
        $user->delete();