app/Http/Controllers/Dashboard/CommentController.php

insert into `comments` (`listing_id`, `user_id`, `parent_id`, `comment`, `updated_at`, `created_at`) values (1, 1, 1, 'aeoiqufjaf', '2025-12-31 17:33:07', '2025-12-31 17:33:07')
---
    public function reply(Request $request, Listing $listing, Comment $comment)
    {
        // Ensure the comment belongs to the listing
        if ($comment->listing_id !== $listing->id) {
            abort(404);
        }

        // Prevent nested replies (only one level allowed)
        if ($comment->parent_id !== null) {
            return redirect()->back()
                ->with('error', __('You cannot reply to a reply.'));
        }

        // Check if user is a commenter for this listing
        $user = auth()->user();
        if (!$user || ($user->commenter_id !== $listing->id)) {
            return redirect()->back()
                ->with('error', __('You are not authorized to reply to comments on this listing.'));
        }

        $request->validate([
            'comment' => 'required|string|max:1000',
        ]);

        Comment::create([
            'listing_id' => $listing->id,
            'user_id' => auth()->id(),
            'parent_id' => $comment->id,
            'comment' => $request->comment,
        ]);