app/Http/Controllers/Dashboard/DashboardController.php

    public function index()
    {
        // Total Statistics - Exclude admins by checking roles
        $totalUsers = User::whereDoesntHave('roles', function($q) {
            $q->whereIn('name', ['admin', 'super-admin']);
        })->count();

        $totalListings = Listing::count();
        $totalOffers = Offer::count();
        $activeOffers = Offer::where('start_date', '<=', now())
            ->where('end_date', '>=', now())
            ->count();
        $totalCategories = Category::count();
        $totalMainCategories = MainCategory::count();
        $totalBranches = ListingBranch::count();
        $totalRatings = Rating::count();
        $totalComments = Comment::count();
        $totalBanners = Banner::count();

        // Recent Activity (Last 30 days)
        $recentUsers = User::whereDoesntHave('roles', function($q) {
            $q->whereIn('name', ['admin', 'super-admin']);
        })->where('created_at', '>=', Carbon::now()->subDays(30))
            ->count();
        $recentListings = Listing::where('created_at', '>=', Carbon::now()->subDays(30))
            ->count();
        $recentOffers = Offer::where('created_at', '>=', Carbon::now()->subDays(30))
            ->count();
---
select count(*) as aggregate from `listings`
select count(*) as aggregate from `offers`
select count(*) as aggregate from `offers` where `start_date` <= '2026-01-01 14:39:36' and `end_date` >= '2026-01-01 14:39:36'
select count(*) as aggregate from `categories`
select count(*) as aggregate from `main_categories`
select count(*) as aggregate from `listing_branches`
select count(*) as aggregate from `ratings`
select count(*) as aggregate from `comments`
select count(*) as aggregate from `banners`
select count(*) as aggregate from `listings` where `created_at` >= '2025-12-02 14:39:36'
select count(*) as aggregate from `offers` where `created_at` >= '2025-12-02 14:39:36'

            ->whereYear('created_at', Carbon::now()->subMonth()->year)
            ->count();

        $thisMonthListings = Listing::whereMonth('created_at', Carbon::now()->month)
            ->whereYear('created_at', Carbon::now()->year)
            ->count();
        $lastMonthListings = Listing::whereMonth('created_at', Carbon::now()->subMonth()->month)
            ->whereYear('created_at', Carbon::now()->subMonth()->year)
            ->count();
---
select count(*) as aggregate from `listings` where month(`created_at`) = '01' and year(`created_at`) = 2026
select count(*) as aggregate from `listings` where month(`created_at`) = '12' and year(`created_at`) = 2025