app/Http/Controllers/Dashboard/ListingController.php

select * from `categories`
select * from `amenities`
select * from `options`
---
    public function index()
    {
        $categories = Category::all();
        $amenities = Amenity::all();
        $options = Option::all();

select * from `categories` where `categories`.`id` in (2)
select `amenities`.*, `amenity_listings`.`listing_id` as `pivot_listing_id`, `amenity_listings`.`amenity_id` as `pivot_amenity_id` from `amenities` inner join `amenity_listings` on `amenities`.`id` = `amenity_listings`.`amenity_id` where `amenity_listings`.`listing_id` in (1)
select `users`.*, `listing_users`.`listing_id` as `pivot_listing_id`, `listing_users`.`user_id` as `pivot_user_id` from `users` inner join `listing_users` on `users`.`id` = `listing_users`.`user_id` where `listing_users`.`listing_id` in (1)
---
    public function show(Listing $listing)
    {
        $listing->load([
            'category',
            'amenities',
            'images',
            'users',
            'comments.user',
            'comments.replies.user'
        ])->loadCount('branches');

select * from `categories` where `categories`.`id` in (2)
select * from `users` where `users`.`id` in (1)
---
    public function comments(Listing $listing)
    {
        $listing->load('category');

        // Paginate comments (only top-level comments, not replies)
        $comments = $listing->comments()
            ->with(['user', 'replies.user'])
            ->latest()
            ->paginate(10);

select `option_values`.*, `listing_option_value`.`listing_id` as `pivot_listing_id`, `listing_option_value`.`option_value_id` as `pivot_option_value_id` from `option_values` inner join `listing_option_value` on `option_values`.`id` = `listing_option_value`.`option_value_id` where `listing_option_value`.`listing_id` in (1)
---
    public function edit(Listing $listing)
    {
        $listing->load('amenities', 'category', 'optionValues', 'images');

delete from `listing_option_value` where `listing_option_value`.`listing_id` = 1 and `listing_option_value`.`option_value_id` in (5)
---

            $listing->amenities()->sync($request->amenities_ids ?? []);

            $listing->optionValues()->sync($request->option_value_ids ?? []);