app/Http/Controllers/Dashboard/UserController.php

    public function destroy(string $id)
    {
        $user = User::findOrFail($id);
        if($user->image){
            Controller::deleteFile($user->image);
        }
        $user->delete();
---
select * from `users` where `users`.`id` = '3' limit 1
delete from `users` where `id` = 3